Revit 2024 API
CableTraySizes.GetCableTraySizes Method
 Gets the cable tray sizes of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public static CableTraySizes GetCableTraySizes(
	Document aDoc
)
Visual Basic
Public Shared Function GetCableTraySizes ( _
	aDoc As Document _
) As CableTraySizes
Visual C++
public:
static CableTraySizes^ GetCableTraySizes(
	Document^ aDoc
)
Parameters
aDoc
Type: Autodesk.Revit.DB.Document
 The document.
Return Value
 The cable tray sizes of the project.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace